Revit 2024 API
SpatialElementTagOrientation Enumeration
 An enumerated type listing tag orientation options that are supported by SpatialElementTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum SpatialElementTagOrientation
Visual Basic
Public Enumeration SpatialElementTagOrientation
Visual C++
public enum class SpatialElementTagOrientation
Members
Member name | Description
Horizontal |  The Orientation of tag is Horizontal.
Vertical |  The Orientation of tag is Vertical.
Model |  The Orientation of tag is Model.
See Also
Autodesk.Revit.DB Namespace